backend/app/controllers/high_scores_controller.rb

  def index
    high_scores = HighScore.where("score_board_id = ?", params[:score_board_id]).order(score: :DESC).limit(10)
---
SELECT "high_scores".* FROM "high_scores" WHERE (score_board_id = '3') ORDER BY "high_scores"."score" DESC LIMIT $1  [["LIMIT", 10]]

  def create
    high_score = HighScore.create(
      difficulty: params[:difficulty],
      initials: params[:initials],
      score: params[:score],
      score_board_id: params[:score_board_id]
      )
---
INSERT INTO "high_scores" ("initials", "score", "difficulty", "score_board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["initials", "AAA"], ["score", 800], ["difficulty", "easy"], ["score_board_id", 1], ["created_at", "2020-07-28 17:53:45.526049"], ["updated_at", "2020-07-28 17:53:45.526049"]]