backend/app/controllers/high_scores_controller.rb

SELECT "high_scores".* FROM "high_scores"
---
  def index
    high_score = HighScore.all