backend/app/controllers/score_boards_controller.rb

SELECT "score_boards".* FROM "score_boards"
---
  def index
    score_boards = ScoreBoard.all

SELECT "score_boards".* FROM "score_boards" WHERE "score_boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    score_board = ScoreBoard.find(params[:id])